// https://www.alukah.net/sharia/0/108314/%D8%AC%D8%A7%D9%85%D8%B9-%D8%A7%D9%84%D8%AF%D8%B9%D8%A7%D8%A1-%D9%85%D9%86-%D8%A7%D9%84%D9%82%D8%B1%D8%A2%D9%86-%D9%88%D8%A7%D9%84%D8%B3%D9%86%D8%A9/
// 91
List<Map<String, String>> DoaasFromQuran = [
  {
    "zekr":
        "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ",
    "reference": "[الفاتحة: 6، 7]",
  },
  {
    "zekr": "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ",
    "reference": "[البقرة: 127]",
  },
  {
    "zekr":
        "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "reference": "[البقرة: 201]",
  },
  {
    "zekr":
        " رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "reference": "[البقرة: 250]",
  },
  {
    "zekr": " رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا",
    "reference": "[البقرة: 286]",
  },
  {
    "zekr":
        "رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا",
    "reference": "[البقرة: 286]",
  },
  {
    "zekr":
        "رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ",
    "reference": "[البقرة: 286]",
  },
  {
    "zekr":
        " رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ ",
    "reference": "[آل عمران: 38]",
  },
  {
    "zekr":
        " رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ ",
    "reference": "[آل عمران: 53]",
  },
  {
    "zekr":
        "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "reference": "[آل عمران: 147]",
  },
  {
    "zekr":
        "رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
    "reference": "[آل عمران: 194]",
  },
  {
    "zekr":
        "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "reference": "[الأعراف: 23]",
  },
  {
    "zekr": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ ",
    "reference": "[الأعراف: 126]",
  },
  {
    "zekr":
        "فَلَا تُشْمِتْ بِيَ الْأَعْدَاءَ وَلَا تَجْعَلْنِي مَعَ الْقَوْمِ الظَّالِمِينَ ",
    "reference": "[الأعراف: 150]",
  },
  {
    "zekr":
        " رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ * وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ ",
    "reference": "[يونس: 85، 86]",
  },
  {
    "zekr":
        "فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
    "reference": "[يوسف: 101]",
  },
  {
    "zekr":
        "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
    "reference": "[إبراهيم: 40]",
  },
  {
    "zekr":
        "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
    "reference": "[إبراهيم: 41]",
  },
  {
    "zekr":
        " رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا",
    "reference": "[الإسراء: 80]",
  },
  {
    "zekr":
        "رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا ",
    "reference": "[الكهف: 10]",
  },
  {
    "zekr":
        " لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "reference": "[الأنبياء: 87]",
  },
  {
    "zekr":
        " رَبِّ أَنْزِلْنِي مُنْزَلًا مُبَارَكًا وَأَنْتَ خَيْرُ الْمُنْزِلِينَ ",
    "reference": "[المؤمنون: 29]",
  },
  {
    "zekr":
        " رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ * وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ",
    "reference": "[المؤمنون: 97، 98]",
  },
  {
    "zekr":
        "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ ",
    "reference": "[المؤمنون: 109]",
  },
  {
    "zekr":
        " رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا * إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا ",
    "reference": "[الفرقان: 65، 66]",
  },
  {
    "zekr":
        " رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
    "reference": "[الفرقان: 74]",
  },
  {
    "zekr":
        " وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ * يَوْمَ لَا يَنْفَعُ مَالٌ وَلَا بَنُونَ * إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ ",
    "reference": "[الشعراء: 87 - 89]",
  },
  {
    "zekr":
        "رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ",
    "reference": "[غافر: 7]",
  },
  {
    "zekr":
        "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ ",
    "reference": "[الأحقاف: 15]",
  },
  {
    "zekr":
        "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ ",
    "reference": " [الممتحنة: 5]",
  },
  {
    "zekr":
        " رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ",
    "reference": "[التحريم: 8]",
  },
  {
    "zekr": " رَبِّ ابْنِ لِي عِنْدَكَ بَيْتًا فِي الْجَنَّةِ ",
    "reference": "[التحريم: 11]",
  },
];
List<Map<String, String>> doasFromSona = [
  {
    "zekr":
        "اللهم صلِّ على محمدٍ وعلى آل محمدٍ كما صليتَ على آل إبراهيم؛ إنك حميد مجيد، اللهم بارك على محمدٍ وعلى آل محمدٍ كما باركتَ على آل إبراهيم؛ إنك حميد مجيد",
    "reference": "(البخاري حديث 6357)",
  },
  {
    "zekr":
        "(اللهم إني ظلمتُ نفسي ظلمًا كثيرًا، ولا يغفر الذنوب إلا أنت؛ فاغفر لي مغفرةً من عندك وارحمني؛ إنك أنت الغفور الرحيم)",
    "reference": "(البخاري حديث: 834 ، 6326)",
  },
  {
    "zekr": "اللهم أغِثْنا، اللهم أغثنا، اللهم أغثنا",
    "reference": "(البخاري حديث: 1014)",
  },
  {
    "zekr":
        "اللهم إني أعوذ بك من عذاب القبر، ومن عذاب النار، ومن فتنة المحيا والممات، ومن فتنة المسيح الدجال",
    "reference": "(البخاري حديث: 1377)",
  },
  {
    "zekr": "اللهم إنك عفوٌّ تحب العفو؛ فاعفُ عني",
    "reference": "(البخاري حديث: 3294)",
  },
  {
    "zekr": "اللهم أنجِ المستضعفين من المؤمنين",
    "reference": "(البخاري حديث: 2932)",
  },
  {
    "zekr": "(يا رب، لا غنَى لي عن بركتك",
    "reference": "(البخاري - حديث: 3391)",
  },
  {
    "zekr":
        "اللهم أحيِني ما كانت الحياة خيرًا لي، وتوفَّني إذا كانت الوفاة خيرًا لي",
    "reference": "(البخاري حديث: 5671)",
  },
  {
    "zekr":
        "اللهم أنت ربي لا إله إلا أنت، خلقتَني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شرِّ ما صنعتُ، أبوء لك بنعمتك عليَّ، وأبوء لك بذنبي فاغفر لي؛ فإنه لا يغفر الذنوب إلا أنت",
    "reference": "(البخاري حديث: 6306)",
  },
  {
    "zekr":
        "اللهم اجعل في قلبي نورًا، وفي بصري نورًا، وفي سمعي نورًا، وعن يميني نورًا، وعن يساري نورًا، وفوقي نورًا، وتحتي نورًا، وأمامي نورًا، وخلفي نورًا، واجعل لي نورًا",
    "reference": "(البخاري حديث: 6316)",
  },
  {
    "zekr":
        "اللهم إني أعوذ بك مِن جَهد البلاء، ودرَك الشقاء، وسوء القضاء، وشماتة الأعداء",
    "reference": "(البخاري حديث: 6347)",
  },
  {
    "zekr":
        "اللهم اغفر لي ذنبي كلَّه؛ دِقَّه وجِلَّه، وأوله وآخره، وعلانيته وسره",
    "reference": " (مسلم حديث: 483)",
  },
  {
    "zekr": "اللهم بارِكْ لهم فيما رزقتهم، واغفر لهم وارحمهم",
    "reference": "(مسلم حديث: 2042)",
  },
  {
    "zekr": "اللهم اغفر لي، وارحمني، واهدِني، وعافِني وارزقني",
    "reference": "(مسلم حديث: 2697)",
  },
  {
    "zekr":
        "للهم أصلِحْ لي دِيني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي، وأصلح لي آخرتي التي فيها معادي، واجعل الحياة زيادةً لي في كل خيرٍ، واجعل الموتَ راحةً لي من كل شر",
    "reference": "(مسلم حديث: 2720)",
  },
  {
    "zekr": "اللهم إني أسألك الهدى والتقى، والعفاف والغنى",
    "reference": "(مسلم حديث: 2721)",
  },
  {
    "zekr":
        "اللهم آتِ نفسي تقواها، وزكِّها أنت خيرُ مَن زكاها، أنت وليُّها ومولاها",
    "reference": "(مسلم حديث: 2722)",
  },
  {
    "zekr":
        "اللهم إني أعوذ بك مِن علمٍ لا ينفع، ومن قلبٍ لا يخشع، ومن نفسٍ لا تشبع، ومن دعوةٍ لا يستجاب لها",
    "reference": " (مسلم حديث: 2722)",
  },
  {
    "zekr":
        "اللهم اغفِرْ لي ما قدمتُ وما أخرت، وما أسررت وما أعلنت، وما أنت أعلم به مني، أنت المقدِّم وأنت المؤخِّر، وأنت على كل شيءٍ قدير",
    "reference": "(مسلم: حديث: 2719)",
  },
  {
    "zekr":
        "اللهم إني أعوذ بك مِن زوال نعمتك، وتحوُّل عافيتك، وفُجاءة نقمتك، وجميع سخَطك",
    "reference": "(مسلم حديث: 2739)",
  },
  {
    "zekr":
        "اللهم أعوذ برضاك مِن سخَطك، وبمعافاتك من عقوبتك، وأعوذ بك منك، لا أحصي ثناءً عليك، أنتَ كما أثنيت على نفسك",
    "reference": "(مسلم - حديث: 486)",
  },
  {
    "zekr": "ربِّ، قِني عذابَك، يوم تبعثُ عبادَك",
    "reference": "(مسلم حديث 709)",
  },
  {
    "zekr":
        "اللهم ربَّ جبرائيل وميكائيل وإسرافيل، فاطر السموات والأرض، عالم الغيب والشهادة، أنت تحكم بين عبادك فيما كانوا فيه يختلفون، اهدِني لما اختُلف فيه من الحق بإذنك؛ إنك تهدي مَن تشاء إلى صراطٍ مستقيمٍ",
    "reference": "(مسلم حديث: 770)",
  },
  {
    "zekr":
        "اللهم أنت الملك، لا إله إلا أنت، أنت ربي، وأنا عبدك، ظلمتُ نفسي، واعترفت بذنبي، فاغفر لي ذنوبي جميعًا، إنه لا يغفر الذنوب إلا أنت، واهدِني لأحسن الأخلاق، لا يهدي لأحسنها إلا أنت، واصرِف عني سيِّئَها، لا يصرف عني سيئها إلا أنت، لبيك وسعديك، والخير كلُّه في يديك، والشرُّ ليس إليك، أنا بكَ وإليك، تباركتَ وتعاليت، أستغفرك وأتوب إليك",
    "reference": "(مسلم حديث: 771)",
  },
  {
    "zekr":
        "اللهم ربَّ السموات ورب الأرض ورب العرش العظيم، ربنا ورب كل شيءٍ، فالقَ الحب والنوى، ومنزلَ التوراة والإنجيل والفرقان، أعوذ بك من شر كل شيءٍ أنت آخذٌ بناصيته",
    "reference": "(مسلم حديث: 2713)",
  },
  {
    "zekr":
        "اللهم لك أسلمتُ، وبك آمنت، وعليك توكلت، وإليك أنَبْتُ، وبك خاصمت، اللهم إني أعوذ بعزتك، لا إله إلا أنت، أن تضلَّني، أنت الحي الذي لا يموت، والجنُّ والإنس يموتون",
    "reference": "(مسلم حديث: 2717)",
  },
  {
    "zekr": "سبحان الله وبحمده، أستغفر اللهَ وأتوب إليه",
    "reference": "(مسلم حديث: 484)",
  },
  {
    "zekr":
        "يا حيُّ، يا قيُّوم، برحمتك أستغيث، أصلِحْ لي شأني كله، ولا تكِلْني إلى نفسي طرفة عينٍ",
    "reference": "(صحيح الترغيب - للألباني - حديث 654)",
  },
  {
    "zekr":
        "اللهم عافِني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت، اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت",
    "reference": "صحيح أبي داود للألباني حديث 4245",
  },
  {
    "zekr":
        "اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في دِيني ودنياي، وأهلي ومالي، اللهم استُرْ عوَرْاتي، وآمِنْ رَوْعاتي، اللهم احفظني من بين يديَّ، ومِن خلفي، وعن يميني، وعن شمالي، ومِن فوقي، وأعوذ بعظمتك أن أُغتالَ من تحتي",
    "reference": "(صحيح أبي داود - للألباني - حديث 4239)",
  },
  {
    "zekr": "وذ بالله العظيم، وبوجهه الكريم، وسلطانه القديم، من الشيطان الرجيم",
    "reference": "(صحيح أبي داود للألباني حديث 441)",
  },
  {
    "zekr":
        "اللهم رحمتَك أرجو؛ فلا تكِلْني إلى نفسي طرفة عينٍ، وأصلِحْ لي شأني كله، لا إله إلا أنت",
    "reference": "(صحيح أبي داود للألباني حديث: 4246)",
  },
  {
    "zekr":
        "اللهم إني أسألك يا أللهُ، الأحد الصمد، الذي لم يلِدْ ولم يولد، ولم يكن له كُفُوًا أحد، أن تغفرَ لي ذنوبي؛ إنك أنت الغفور الرحيم",
    "reference": "(صحيح أبي داود للألباني حديث: 869)",
  },
  {
    "zekr": "اللهم أعنِّي على ذِكرك، وشُكرك، وحُسن عبادتك",
    "reference": "(صحيح أبي داود للألباني حديث: 1347)",
  },
  {
    "zekr":
        "ربِّ، أعنِّي ولا تُعِنْ عليَّ، وانصرني ولا تنصر عليَّ، وامكر لي ولا تمكُرْ عليَّ، واهدِني، ويسِّر لي الهدى، وانصرني على مَن بغى علي",
    "reference": "(صحيح أبي داود - للألباني حديث 1337)",
  },
  {
    "zekr":
        "ربِّ، تقبَّل توبتي، واغسل حَوْبتي، وأجِبْ دعوتي، وثبِّتْ حجتي، وسدِّد لساني، واهدِ قلبي، واسلُلْ سَخِيمة صدري",
    "reference": "(صحيح أبي داود - للألباني حديث 1337)",
  },
  {
    "zekr":
        "لحمد لله رب العالمين، الرحمن الرحيم، ملك يوم الدين، لا إله إلا الله، يفعل ما يريد، اللهم أنت الله، لا إله إلا أنت، الغنيُّ ونحن الفقراء، أنزِلْ علينا الغيثَ، واجعل ما أنزلتَ لنا قوةً وبلاغًا إلى حينٍ",
    "reference": "(صحيح أبي داود - للألباني - حديث: 1173)",
  },
  {
    "zekr":
        "اللهم إني أعوذ بك من الفقر، والقلَّة، والذلَّة، وأعوذ بك مِن أن أُظلَم، أو أَظلِم",
    "reference": "(صحيح أبي داود - للألباني - حديث: 1366)",
  },
  {
    "zekr":
        "اللهم اهدِني فيمن هدَيتَ، وعافني فيمن عافيتَ، وتولَّني فيمن تولَّيتَ، وبارك لي فيما أعطيتَ، وقِني شر ما قضيت؛ فإنك تقضي ولا يقضى عليك، وإنه لا يَذِلُّ مَن واليتَ، تباركتَ ربَّنا وتعاليت",
    "reference": "(صحيح الترمذي للألباني حديث 411)",
  },
  {
    "zekr":
        "للهم إني أسألك فِعل الخيرات، وترك المنكَرات، وحبَّ المساكين، وإذا أردتَ بعبادك فتنةً، فاقبِضْني إليك غيرَ مفتونٍ",
    "reference": "(صحيح الترمذي - للألباني حديث: 2580)",
  },
  {
    "zekr":
        "اللهم اقسِمْ لنا مِن خشيتك ما يحول بيننا وبين معاصيك، ومِن طاعتك ما تبلِّغنا به جنتَك، ومِن اليقين ما تهوِّن به علينا مصيبات الدنيا، ومتِّعنا بأسماعنا وأبصارنا وقوَّتنا ما أحييتَنا، واجعله الوارثَ منا، واجعل ثأرَنا على مَن ظلمنا، وانصرنا على مَن عادانا، ولا تجعل مصيبتَنا في دِيننا، ولا تجعل الدنيا أكبرَ همنا، ولا مبلَغ علمنا، ولا تسلِّط علينا مَن لا يرحمنا",
    "reference": "(صحيح الترمذي - للألباني حديث: 2783)",
  },
  {
    "zekr":
        "اللهم فاطرَ السموات والأرض، عالم الغيب والشهادة، لا إله إلا أنت، ربَّ كل شيءٍ ومليكَه، أعوذ بك مِن شر نفسي، ومن شر الشيطان وشِركِه، وأن أقترف على نفسي سوءًا، أو أجُرَّه إلى مسلمٍ",
    "reference": "(صحيح الترمذي - للألباني حديث: 2783)",
  },
  {
    "zekr": "اللهم اكفِني بحلالك عن حرامِك، وأغنِني بفضلِك عمَّن سواك",
    "reference": "(صحيح الترمذي للألباني حديث: 2822)",
  },
  {
    "zekr":
        "اللهم إني أسألك مِن الخير كلِّه، عاجلِه وآجِلِه، ما علمتُ منه وما لم أعلم، وأعوذ بك من الشر كلِّه، عاجلِه وآجلِه، ما علمتُ منه وما لم أعلم",
    "reference": "(صحيح ابن ماجه - للألباني - حديث 3102)",
  },
  {
    "zekr":
        "للهم إني أسألك الجنةَ وما قرَّب إليها من قولٍ أو عملٍ، وأعوذ بك مِن النار وما قرَّب إليها من قولٍ أو عملٍ، وأسألك أن تجعلَ كل قضاءٍ قضيتَه لي خيرًا",
    "reference": "(صحيح ابن ماجه - للألباني - حديث 3102)",
  },
  {
    "zekr":
        "اللهم اغفِرْ لحيِّنا وميِّتنا، وشاهدِنا وغائبنا، وصغيرنا وكبيرنا، وذَكَرِنا وأُنْثانا، اللهم مَن أحييتَه منا فأحيِه على الإسلام، ومَن توفَّيتَه منا فتوَفَّهُ على الإيمان",
    "reference": "(صحيح ابن ماجه - للألباني - حديث 1217)",
  },
  {
    "zekr":
        "اللهم اغفِرْ لي ذَنبي، ووسِّعْ لي في داري، وبارِكْ لي فيما رزقتَني",
    "reference": "(صحيح ابن ماجه - للألباني - حديث 1217)",
  },
];
